Tekla.Structures.Analysis.AnalysisMember
The AnalysisMember class contains information related to analysis members.

Tekla.Structures.Analysis.AnalysisMember._Material
The material of the analysis member.

Tekla.Structures.Analysis.AnalysisMember._Label
The label of the analysis member.

Tekla.Structures.Analysis.AnalysisMember._Start
The analysis beam end settings at the start of the member.

Tekla.Structures.Analysis.AnalysisMember._End
The analysis beam end settings at the end of the member.

Tekla.Structures.Analysis.AnalysisMember._Curvature
The beam curvature of the member.

Tekla.Structures.Analysis.AnalysisMember._Composite
The composite settings of the member.

Tekla.Structures.Analysis.AnalysisMember._AnalysisDesignCode
The analysis design code of the member.

Tekla.Structures.Analysis.AnalysisMember.Material
The material of the analysis member.

Tekla.Structures.Analysis.AnalysisMember.Label
The label of the analysis member.

Tekla.Structures.Analysis.AnalysisMember.Start
The analysis beam end settings at the start of the member.

Tekla.Structures.Analysis.AnalysisMember.End
The analysis beam end settings at the end of the member.

Tekla.Structures.Analysis.AnalysisMember.Curvature
The beam curvature of the member.

Tekla.Structures.Analysis.AnalysisMember.Composite
The composite settings of the member.

Tekla.Structures.Analysis.AnalysisMember.AnalysisDesignCode
The analysis design code of the member.

Tekla.Structures.Analysis.AnalysisMember.Modify
Modifies an analysis member.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisMember.Select
Selects an analysis member.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisMember.CopyData(Tekla.Structures.Analysis.AnalysisMember)
Copies data from another analysis member.
AnalysisMember: The analysis member to copy data from.

Tekla.Structures.Analysis.AnalysisMember.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisMember.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisMember.CollectData
Collects additional data.

Tekla.Structures.Analysis.AnalysisMember.CopyDataFromInstance(Tekla.Structures.Analysis.AnalysisMember)
Copies data from another member